@antonbabenko this is our code. We have the modules file inside `distribution` folder. In our `resources.tf` We are looping over our map of object variable `cloudfront_distributions` in our `variables.tf `. We are passing the values in `main.tf`.

`Problem statement:`

We have multiple cloudfront distributions. 

- Some distributions have s3_origin_config some of them dont have this. But since we are passing default value because of for_each condition it creates the empty s3_origin_config {} for the distributions were we dont have it. The issue is that since the default for_each condition doesn't null the dynamic resources it expects `{} `.

- Some distributions have custom_origin_config but some of them dont have it. But since the module expects the default value to be {} we have to pass the default value as { http_port = 80, https_port = 443, origin_protocol_policy   = "https-only", origin_read_timeout = 30, origin_ssl_protocols = [     "TLSv1.2",   ]} since we have required values in custom_origin_config we cant pass it as empty {}. And if we pass this value the custom_origin_config would also get created for the resources that dont have it. 

If we pass null as default we get error on the module. So we have purposed this change to fix this issue.

See the sample plan here:

````
terraform plan

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.distributions.module.cloudfront_distributions["test-cf-custom-origin-config"].aws_cloudfront_distribution.this[0] will be created
  + resource "aws_cloudfront_distribution" "this" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = {
          + "Environment"       = "dev"
          + "terraform-project" = "TerraformCloudFront"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods          = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cache_policy_id          = "4135ea2d-6df8-44a3-9df3-4b5a84be39ad"
          + cached_methods           = [
              + "GET",
              + "HEAD",
            ]
          + compress                 = false
          + default_ttl              = 0
          + max_ttl                  = 0
          + min_ttl                  = 0
          + origin_request_policy_id = "216adef6-5c7f-47e4-b989-5492eafa07d3"
          + target_origin_id         = "Custom-d-i6nfbb6r11.execute-api.us-east-1.amazonaws.com"
          + trusted_key_groups       = (known after apply)
          + trusted_signers          = (known after apply)
          + viewer_protocol_policy   = "redirect-to-https"
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "d-i6nfbb6r11.execute-api.us-east-1.amazonaws.com"
          + origin_id           = "Custom-d-i6nfbb6r11.execute-api.us-east-1.amazonaws.com"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }

          + s3_origin_config {}
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.distributions.module.cloudfront_distributions["test-s3-origin-config"].aws_cloudfront_distribution.this[0] will be created
  + resource "aws_cloudfront_distribution" "this" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = {
          + "Environment"       = "dev"
          + "terraform-project" = "TerraformCloudFront"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + target_origin_id       = "S3-simulation-harri-transcoded"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = []

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "beta-harri-transcoded.s3.amazonaws.com"
          + origin_id           = "S3-simulation-harri-transcoded"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }

          + s3_origin_config {
              + origin_access_identity = "origin-access-identity/cloudfront/E219MQIHXDF2BU"
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
````

`resources.tf`
````
module "cloudfront_distributions" {
  source                               = "terraform-aws-modules/cloudfront/aws"
  version                              = "3.4.0"
  for_each                             = var.cloudfront_distributions
  default_cache_behavior               = each.value["default_cache_behavior"] != null ? each.value["default_cache_behavior"] : null
  origin                               = each.value["origin"] != null ? each.value["origin"] : {}
}
````

`variables.tf`
````
##################################################################################
# VARIABLES
##################################################################################

variable "cloudfront_distributions" {
  type = map(object({
    default_cache_behavior = optional(object({
      target_origin_id       = string                                  # The ID of the origin that you want CloudFront to route requests to when they match the path pattern for this cache behavior.
      viewer_protocol_policy = string                                  # The protocol that viewers can use to access the files in the origin specified by target_origin_id when a request matches the path pattern.
      allowed_methods        = optional(list(string), ["GET", "HEAD"]) # List of allowed methods (e.g., GET, HEAD, OPTIONS, PUT, POST, PATCH, DELETE).
      cached_methods         = optional(list(string), ["GET", "HEAD"]) # List of cached methods (e.g., GET, HEAD).
      compress               = optional(bool, true)                    # Whether you want CloudFront to automatically compress certain files for this cache behavior.
      lambda_function_association = optional(list(object({
        event_type   = string                # Specifies the event type that triggers a Lambda function invocation.
        lambda_arn   = string                # The ARN of the Lambda function.
        include_body = optional(bool, false) # Whether to include the body content.
      })), [])
      cache_policy_id          = optional(string, null) # The ID of the cache policy for the default cache behavior.
      origin_request_policy_id = optional(string, null) # The ID of the origin request policy for the default cache behavior.
      use_forwarded_values     = optional(bool, true)   # If true, use `forwarded_values` instead of cache and origin request policies.
      query_string             = optional(bool, false)  # Indicates whether you want CloudFront to forward query strings to the origin.
      cookies = optional(object({
        forward           = string                     # Specifies which cookies to forward to the origin.
        whitelisted_names = optional(list(string), []) # Specifies the names of the cookies you want CloudFront to forward to your origin.
        }), {
        forward = "none"
      })
      headers                 = optional(list(string), []) # Specifies the headers you want CloudFront to forward to your origin.
      query_string_cache_keys = optional(list(string), []) # Specifies the list of query string parameters that you want CloudFront to use as a basis for caching.

      min_ttl     = optional(number, 0)        # The minimum amount of time that you want objects to stay in CloudFront caches before CloudFront queries your origin to see if the object has been updated.
      default_ttl = optional(number, 86400)    # The default amount of time that you want objects to stay in CloudFront caches before CloudFront queries your origin to see if the object has been updated.
      max_ttl     = optional(number, 31536000) # The maximum amount of time that you want objects to stay in CloudFront caches before CloudFront queries your origin to see if the object has been updated.
    }), null)
    origin = optional(map(object({
      connection_attempts      = optional(number, 10)
      connection_timeout       = optional(number, 10)
      domain_name              = string
      origin_access_control_id = optional(string, null)
      origin_id                = optional(string, null)
      origin_path              = optional(string, "")
      s3_origin_config = optional(object({
        cloudfront_access_identity_path = optional(string, "")
        origin_access_identity          = optional(string,"")
      }), {})
      custom_origin_config = optional(object({
        http_port                = number
        https_port               = number
        origin_protocol_policy   = string
        origin_ssl_protocols     = list(string)
        origin_keepalive_timeout = optional(number, null)
        origin_read_timeout      = optional(number, null)
      }), { http_port = 80, https_port = 443, origin_protocol_policy   = "https-only", origin_read_timeout = 30, origin_ssl_protocols = [     "TLSv1.2",   ]})
    })), {})
  }))
  default     = {}
  description = "Specify all CloudFront distribution configurations"
}

````

`main.tf`

````
module "distributions" {
  source = "../distributions/"

  cloudfront_distributions = {
    # test resource for s3-origin-config settings
    "test-s3-origin-config" = {
      origin = {
        origin1 = {
          connection_attempts = 3 
          connection_timeout  = 10 
          domain_name         = "beta-harri-transcoded.s3.amazonaws.com" 
          origin_id           = "S3-simulation-harri-transcoded"
          s3_origin_config = {
             cloudfront_access_identity_path = "origin-access-identity/cloudfront/E219MQIHXDF2BU"
           }
        }
      }
      default_cache_behavior = {
        target_origin_id       = "S3-simulation-harri-transcoded"
        viewer_protocol_policy = "allow-all"
        allowed_methods        = ["GET", "HEAD"]
        cached_methods         = ["GET", "HEAD"]
        use_forwarded_values   = true
        compress               = false
      }
    }
    # test resource for custom-origin-config settings
    "test-cf-custom-origin-config" = {
      origin = {
        origin1 = {
          connection_attempts = 3
          connection_timeout  = 10
          domain_name         = "d-i6nfbb6r11.execute-api.us-east-1.amazonaws.com"
          origin_id           = "Custom-d-i6nfbb6r11.execute-api.us-east-1.amazonaws.com"
          custom_origin_config = {
              http_port                = 80
              https_port               = 443
              origin_keepalive_timeout = 5
              origin_protocol_policy   = "https-only"
              origin_read_timeout      = 30
              origin_ssl_protocols     = [
                  "TLSv1.2",
                ]
          }
        }
      }
      default_cache_behavior = {
        target_origin_id       = "S3-simulation-harri-backend"
        viewer_protocol_policy = "redirect-to-https"
        allowed_methods        = ["DELETE", "GET", "HEAD", "OPTIONS", "PATCH", "POST", "PUT"]
        cached_methods         = ["GET", "HEAD"]
        cache_policy_id        = "4135ea2d-6df8-44a3-9df3-4b5a84be39ad"
        compress               = false
        use_forwarded_values   = false
        headers = [
          "Access-Control-Request-Headers",
          "Access-Control-Request-Method",
          "Origin"
        ]

        default_ttl              = 0
        max_ttl                  = 0
        origin_request_policy_id = "216adef6-5c7f-47e4-b989-5492eafa07d3"
        target_origin_id         = "Custom-d-i6nfbb6r11.execute-api.us-east-1.amazonaws.com"
      }
    }
  }
}

````
